/* ************************************************************************ */
/*      Include Files                                                       */
/* ************************************************************************ */

#include <WiFi.h>

/* ************************************************************************ */
/*      Parameters                                                          */
/* ************************************************************************ */

// WiFi information
char* ssid = "Username"; // เปลี่ยนเป็น ชื่อ WiFi
char* pass = "password"; // เปลี่ยนเป็น รหัส WiFi

/* ************************************************************************ */
/*      Code Section                                                        */
/* ************************************************************************ */

// สำหรับการใช้ WiFi และ MQTT
WiFiClient espClient;                // สำหรับเชื่อมต่อ WiFi

// ฟังก์ชันเชื่อมต่อ WiFi
void setupWiFi() {
    Serial.println("Connecting to WiFi..."); // แสดงข้อความก่อนเชื่อม WiFi
    WiFi.begin(ssid, pass);              // เชื่อมต่อ WiFi

    // รอจนกว่าจะเชื่อมต่อสำเร็จ หากไม่สำเร็จหน่วงเวลา 1 วินาที
    while (WiFi.status() != WL_CONNECTED) {  
        delay(1000);        
        Serial.print("."); 
    }

    // แสดงข้อความเมื่อเชื่อมต่อสำเร็จ
    Serial.println("WiFi connected!");

    // แสดง IP address
    Serial.print("Local ESP32 IP address: ");
    Serial.println(WiFi.localIP());
}

/* ************************************************************************ */
/*      Main Functions                                                      */
/* ************************************************************************ */

void setup() {
    Serial.begin(9600);
    setupWiFi();                             // เชื่อมต่อ WiFi
}

void loop() {
    //pass
}
